const pushkinBiography = {
    0: "Александр Сергеевич Пушкин родился 6 июня (26 мая по старому стилю) 1799 года в Москве в дворянской семье. Его детство было пропитано литературой, благодаря богатой домашней библиотеке.",
    1: "Пушкин был воспитан дома и в лицее, где проявил выдающиеся литературные способности. В лицее он знакомится с классикой, что оказывает глубокое влияние на его будущее творчество.",
    2: "В 1820 году Пушкин отправился в заточение на юг России, а затем в Кавказскую армию. Этот период стал для него временем самоанализа, вдохновившего создание нескольких известных стихотворений.",
    3: "В 1826 году Пушкин вернулся в Петербург, где начал свою журналистскую деятельность. Он активно участвовал в литературной жизни, поддерживал идеи романтизма и публиковал свои произведения в журналах.",
    4: "Знаменитые произведения Пушкина включают 'Евгений Онегин', 'Руслан и Людмила', 'Полтава' и многие другие. Эти произведения стали классикой русской литературы и оказали глубокое воздействие на развитие литературного направления.",
    5: "Пушкин погиб в дуэли 29 января (27 января по старому стилю) 1837 года в результате ран, полученных при дуэли с Жоржем Шарлем Дантесом. Его смерть стала трагической черной страницей в истории русской литературы."
};

const lermontovBiography = {
    0: "Михаил Юрьевич Лермонтов родился 15 (3 по старому стилю) октября 1814 года в Москве. Его детство было теневым из-за потери родителей: матери, умершей, когда ему было два года, и отца, убитого в дуэли.",
    1: "Лермонтов был сиротой, потому что его мать умерла, когда ему было два года, а отец был убит в дуэли, когда Михаил был еще ребенком. Это влияло на его характер и творчество, делая их более мрачными и мистическими.",
    2: "В 1834 году Лермонтов поступил в пажеский корпус, а затем в Константиновское училище, где начал писать свои первые стихи. Его стихи выражали бунтарский дух, и он часто поднимал социальные и политические вопросы.",
    3: "Знаменитые произведения Лермонтова включают 'Герой нашего времени', 'Мцыри', 'Демон' и многие другие стихотворения. Его творчество стало ярким представителем романтизма в русской литературе.",
    4: "Лермонтов был страстным сторонником свободы и прогресса, что привело к его конфликту с царским правительством. Его сочинения были запрещены цензурой, что только усилило его популярность среди общества.",
    5: "Лермонтов погиб в дуэли 27 (15 по старому стилю) июля 1841 года в результате ран, полученных при дуэли с коллегой по армии Николаем Мартыновым. Его смерть стала символом борьбы за свободу и неприклонного духа."
};

const mayakovskyBiography = {
    0: "Владимир Владимирович Маяковский родился 19 июля (7 июля по старому стилю) 1893 года в городе Багдати, Грузия. Его раннее детство прошло в городе Кутаиси, где он заложил основы своего творчества и влюбился в поэзию.",
    1: "Маяковский вырос в городе Кутаиси и затем поступил в московскую школу живописи, скульптуры и архитектуры. В это время он активно участвовал в культурной жизни, общался с художниками и литераторами, формируя свой художественный взгляд.",
    2: "В начале 1910-х годов Маяковский вступил в контакт с футуристическим движением и стал одним из его лидеров. Его стихи приобрели новаторский характер, отражая дух времени и вызывая общественный интерес.",
    3: "Он написал множество стихов, в которых выражал свою поддержку революции и социальным переменам в стране. Его поэзия стала звучным манифестом технологического и социального прогресса.",
    4: "Среди наиболее известных произведений Маяковского - поэмы 'Облако в штанах', 'Лирика', '150 000 000' и 'Владимир Ильич Ленин'. Его творчество сильно повлияло на русскую поэзию и искусство в период модернизма и авангарда.",
    5: "Владимир Маяковский покончил с собой 14 апреля 1930 года. Его трагическая смерть оставила след в истории русской культуры, подчеркивая сложности сочетания творческого вдохновения и социальных изменений."
};

const eseninBiography = {
    0: "Сергей Александрович Есенин родился 21 сентября (9 сентября по старому стилю) 1895 года в посёлке Константиново Рязанской губернии. Его детство прошло в бедной крестьянской семье, и рано он стал сталкиваться с трудностями сельской жизни.",
    1: "Есенин прошел небольшое образование в церковно-приходской школе, но его настоящим учителем стала природа. Он открыл для себя красоту родной природы и стал вдохновляться ею в своих будущих произведениях.",
    2: "В 1912 году Есенин переехал в Петербург, где начал активно публиковаться. Его стихи привлекли внимание как интенсивным эмоциональным содержанием, так и новаторским стилем. В это время он также познакомился с литературными кругами и стал участником поэтических обществ.",
    3: "Знаменитые произведения Есенина включают 'Россия вперёд', 'Пугачев', 'Алые паруса' и многие другие. Его стихи отражают темы любви, природы, родины, а также социальные вопросы того времени.",
    4: "Есенин был связан с культурными изменениями в России и принимал активное участие в общественной жизни. Он был также членом литературной группы 'Цех поэтов', где обсуждались актуальные литературные и политические вопросы.",
    5: "Трагическая судьба Есенина завершилась 27 декабря (15 декабря по старому стилю) 1925 года. Он покончил с собой, оставив миру свои волнующие стихи, которые останутся в истории русской поэзии как выразительное проявление эмоций и чувств."
};

const pashkovBiography = {
    0: "Пашков Дмитрий Сергеевич родился 11 июня 2004 года в городе Лабинск Краснодарского края.",
    1: "С детства Дмитрий отличался высоким интеллектом, но не пользовался популярностью в своём окружении. Эта особенность личности сформировала у него тягу к самостоятельному мышлению и творчеству.",
    2: "Закончив школу в 2022 году с красным аттестатом, он встал перед выбором учреждения для получения высшего образования.",
    3: "Не долго думая, он подал документы в лучший ВУЗ мира - РТУ МИРЭА, на направление Программная инженерия. Его стремление к технологиям сочетается с увлечением философией и литературой.",
    4: "Несмотря на тягу к технологиям, поэзия постоянно пронизывала его жизнь. Стихотворения его руки наполнены смыслом и философией. Он находит в поэзии способ выражения своих мыслей и эмоций.",
    5: "А на втором курсе обучения в рамках курсовой работы он и создал сайт, на котором вы сейчас находитесь. :)"
};

const pushkinPictures = {
    0: "images/bio/pushkinBio_0.jpg",
    1: "images/bio/pushkinBio_1.jpg",
    2: "images/bio/pushkinBio_2.jpg",
    3: "images/bio/pushkinBio_3.jpg",
    4: "images/bio/pushkinBio_4.jpg",
    5: "images/bio/pushkinBio_5.jpg"
};
const lermontovPictures = {
    0: "images/bio/lermontovBio_0.jpg",
    1: "images/bio/lermontovBio_1.jpg",
    2: "images/bio/lermontovBio_2.jpg",
    3: "images/bio/lermontovBio_3.jpg",
    4: "images/bio/lermontovBio_4.jpg",
    5: "images/bio/lermontovBio_5.jpg"
};
const mayakovskyPictures = {
    0: "images/bio/mayakovskyBio_0.jpg",
    1: "images/bio/mayakovskyBio_1.jpg",
    2: "images/bio/mayakovskyBio_2.jpg",
    3: "images/bio/mayakovskyBio_3.jpg",
    4: "images/bio/mayakovskyBio_4.jpg",
    5: "images/bio/mayakovskyBio_5.jpg"
};
const eseninPictures = {
    0: "images/bio/eseninBio_0.jpg",
    1: "images/bio/eseninBio_1.jpg",
    2: "images/bio/eseninBio_2.jpg",
    3: "images/bio/eseninBio_3.jpg",
    4: "images/bio/eseninBio_4.jpg",
    5: "images/bio/eseninBio_5.jpg"
};
const pashkovPictures = {
    0: "images/bio/pashkovBio_0.jpg",
    1: "images/bio/pashkovBio_1.jpg",
    2: "images/bio/pashkovBio_2.jpg",
    3: "images/bio/pashkovBio_3.jpg",
    4: "images/bio/pashkovBio_4.jpg",
    5: "images/bio/pashkovBio_5.jpg"
};

// Добавим событие загрузки страницы для выполнения кода при открытии страницы
document.addEventListener('DOMContentLoaded', function () {
    const urlParams = new URLSearchParams(window.location.search);
    const poetId = urlParams.get('id');

    const heading = document.getElementById('biography-header');
    const biographyText = document.getElementsByClassName('biography-text');
    const biographyImage = document.getElementsByClassName('biography-image');

    if (poetId === '1') {
        heading.innerText = "Биография Пушкина А.С.";

        let indexBio = 0;
        Array.from(biographyText).forEach(element => {
            element.innerText = pushkinBiography[indexBio];
            indexBio += 1;
        });

        let indexPic = 0;
        Array.from(biographyImage).forEach(element => {
            element.src = pushkinPictures[indexPic];
            indexPic += 1;
        });
    } else if (poetId === '2') {
        heading.innerText = "Биография Лермонтова М.Ю.";

        let indexBio = 0;
        Array.from(biographyText).forEach(element => {
            element.innerText = lermontovBiography[indexBio];
            indexBio += 1;
        });

        let indexPic = 0;
        Array.from(biographyImage).forEach(element => {
            element.src = lermontovPictures[indexPic];
            indexPic += 1;
        });
    }
    else if (poetId === '3') {
        heading.innerText = "Биография Пашкова Д.С.";

        let indexBio = 0;
        Array.from(biographyText).forEach(element => {
            element.innerText = pashkovBiography[indexBio];
            indexBio += 1;
        });

        let indexPic = 0;
        Array.from(biographyImage).forEach(element => {
            element.src = pashkovPictures[indexPic];
            indexPic += 1;
        });
    }
    else if (poetId === '4') {
        heading.innerText = "Биография Маяковского В.В.";

        let indexBio = 0;
        Array.from(biographyText).forEach(element => {
            element.innerText = mayakovskyBiography[indexBio];
            indexBio += 1;
        });

        let indexPic = 0;
        Array.from(biographyImage).forEach(element => {
            element.src = mayakovskyPictures[indexPic];
            indexPic += 1;
        });
    }
    else if (poetId === '5') {
        heading.innerText = "Биография Есенина С.А.";

        let indexBio = 0;
        Array.from(biographyText).forEach(element => {
            element.innerText = eseninBiography[indexBio];
            indexBio += 1;
        });

        let indexPic = 0;
        Array.from(biographyImage).forEach(element => {
            element.src = eseninPictures[indexPic];
            indexPic += 1;
        });
    }
});